Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ནམ་མཁའ་ལྡིང་རྣམས་དང་། མི་འམ་ཅི་རྣམས་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ལ་སོ་སོའི་གཞལ་མེད་ཁང་ཅི་ལྟ་བ་དེ་ལྟ་བུ་དག་འབྱུང་བར་འགྱུར་རོ། །མི་རྣམས་ཀྱི་ཁང་པ་ཅི་ལྟ་བ་དང་། ཁ་ཟས་ཀྱི་མཆོག་ཅི་ལྟ་བུ་དག་འབྱུང་བར་འགྱུར་རོ།
en: All the palaces and fine foods will manifest exactly as appropriate for humans’ individual needs. “

source: །དེ་ལྟ་བས་ན་དགོས་པའི་རྣམ་པ་ཐམས་ཅད་བགྱི་བ་དང་། དེ་ཁོ་ན་ཉིད་སྒྲུབ་པའི་ཇི་སྐད་གསུངས་པའི་ཆོ་ག་ཞིབ་མོ་དང་།
en: All the ritual tasks need to be performed as specified for accomplishing reality.

source: ཆོ་ག་དང་གསང་སྔགས་སྒྲུབ་པ་རྣམས་བགྱིའོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་གྲུབ་པ་བླ་ན་མེད་པ་ཐམས་ཅད་འཐོབ་པར་འགྱུར་རོ།
en: The mantra practices must be done according to the correct procedure, and only then will the vidyā holder obtain the full range of supreme accomplishments.

source: །གལ་ཏེ་རིག་སྔགས་འཆང་གིས་ལས་ཡོངས་སུ་གྲུབ་པར་བགྱིས་ཏེ། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་འདི་བརྗོད་པ་ཙམ་གྱིས་རིག་སྔགས་འཆང་གི་མདུན་དུ་བདག་རང་གི་གཟུགས་ཀྱིས་ཉེ་བར་མཆིས་ནས་བསམ་པ་དང་རེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱིའོ།
en: If he performs all the ritual tasks in full, then I will appear before him in person as soon as he recites the heart mantra of Amoghapāśa.

source: །སྡིག་པ་དང་སྒྲིབ་པ་དང་། གནོད་པ་ཐམས་ཅད་འཇིག་པར་འགྱུར་རོ། །ཡོངས་སུ་དག་པའི་ལྷ་ཆེན་པོ་ལྟར་ལུས་དག་པར་བགྱིའོ། །ཆོ་ག་ཞིབ་མོ་དང་། ཕྱག་རྒྱ་དང་།
en: I will completely fulfill all his hopes and wishes, remove all his wrongdoings, obscurations, and negativity, and purify his body so that it becomes a divine, completely pure form. “

source: གསང་སྔགས་དང་། སྙིང་པོ་དང་། དཀྱིལ་འཁོར་དང་། དོན་ཡོད་པའི་ཞགས་པའི་རྒྱལ་པོའི་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་གྲུབ་པའི་མཆོག་ཐམས་ཅད་སྩལ་བར་བགྱིའོ། །རིག་སྔགས་འཆང་འཁོར་ལོས་སྒྱུར་བ་ཆེན་པོའི་དབང་བསྐུར་བས་དབང་བསྐུར་བར་བགྱིའོ།
en: I will grant the vidyā holder the supreme accomplishment of Amogharāja’s maṇḍala of liberation—the maṇḍala that constitutes the essence of Amogharāja’s rites with their mudrās and mantras.

source: །དེ་ཁོ་ན་ཉིད་ཡང་དག་པ་སྒྲུབ་པའི་གྲུབ་པ་སྩལ་བར་བགྱིའོ།
en: I will consecrate him as the great vidyādhara emperor and grant him the accomplishment of the true nature of things.

source: །དོན་ཡོད་པའི་ཞགས་པའི་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་སྒྲུབ་པའི་གྲུབ་པ་ཆེན་པོ་སྩལ་བར་བགྱིའོ།
en: I will grant him the worldly and supramundane accomplishments of the practice of great Amoghapāśa.

source: །ཤིན་ཏུ་རྒྱ་ཆེ་ཞིང་བག་ཚ་བ་མ་མཆིས་པ་དང་།
en: I will likewise grant him the fearlessnesses in all their vastness.

source: མཆོད་པ་དང་བཀུར་སྟི་ཆེན་པོ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མཆོག་ཁྱད་པར་དུ་འཕགས་ཤིང་ནོར་འདུ་བའི་བཀྲ་ཤིས་དང་དཔལ་སྩལ་བར་བགྱིའོ།
en: I will make him most distinguished among all people, who will worship and greatly respect him. I will grant him wealth and divine splendor.

source: །འདི་ལ་ཡིད་གཉིས་དང་སོམ་ཉི་བསྐྱེད་པར་མི་བགྱི་ཞིང་།
en: This should not be doubted or called into question. “

source: དངོས་པོ་གཞན་དུ་ཡང་ཡིད་ལ་མི་བགྱིའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཀྱིས་བརྩེ་བ་ལ་མཆོག་ཏུ་བརྩོན་པར་བགྱིའོ།
en: The vidyā holder should not be preoccupied with other things but should feel love and compassion for all beings with all his heart, rejoicing at their happiness and treating them with equanimity.

source: །བུ་གཅིག་པ་བཞིན་དུ་སེམས་ཅན་དུ་གྱུར་པ་ཐམས་ཅད་ལ་མཆོག་ཏུ་བརྩེ་བར་བགྱིའོ།
en: He should treat each and every being with the same care that he has for his only son.

source: །བདེན་པར་སྨྲ་བ་དང་། བདེན་པ་ལ་དགའ་བ་དང་། སྙན་པར་སྨྲ་བ་དང་།
en: Delighting in truth, he should speak the truth, and his words should be pleasant to hear.

source: སྙིང་རྗེའི་ལྷག་པའི་བསམ་པས་དམིགས་ནས། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་པར་བགྱིའོ། །བཟླས་བརྗོད་ཀྱི་ཆོ་ག་བགྱི་ཞིང་། ཕྱག་རྒྱ་དང་གསང་སྔགས་ཀྱང་བཟླས་པར་བགྱིའོ།
en: Having developed the heart of compassion, he should memorize the heart essence of Amoghapāśa, perform recitation according to procedure, and employ both the mudrās and the mantras.

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་གཏོགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཡིད་ལ་བགྱིས་ནས།
en: He should contemplate all the tathāgatas in the buddha fields in the ten directions.

source: སངས་རྒྱས་ཡིད་ལ་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བགྱིའོ། །སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་བགྱིའོ།
en: He should recollect the Buddha and pay homage to him and all the bodhisattvas.

source: །འཕགས་པ་མགོན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ཕྱག་བགྱིས་ནས། མངོན་སུམ་དུ་བསྒོམ་པར་བགྱིའོ།
en: He should also visualize Noble Avalokiteśvara in front of himself and pay homage to him.

source: །བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རི་མོའི་གཟུགས་ལ་ཕྱག་བགྱིས་ཏེ། མདུན་དུ་རྩྭའི་གདིང་བ་བཏིང་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་མཆིས་ནས་གཞན་མི་སྨྲ་བར་བཟླས་པ་བགྱིས་ཏེ། འདི་ནི་གསང་བའི་དེ་ཁོ་ན་ཉིད་བསྒྲུབ་པའོ།
en: He should sit cross-legged on a bed of darbha grass in front of a cloth painting of Noble Lord Avalokiteśvara and recite the mantra without saying anything else, as this will bring the realization of secret reality. “

source: །དེ་ནས་ཕྱག་རྒྱ་དང་གསང་སྔགས་བརྗོད་པར་བགྱིའོ། །བདག་ལ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་དེ་ཁོ་ན་ཉིད་གྲུབ་པར་གྱུར་ཅིག །
en: I will now teach the mudrā and mantra that bring true accomplishment of the essence of Amoghapāśa, which is imbued with the blessing of the accomplishment of the essence of Amoghapāśa as it really is.

source: འཇིག་རྟེན་དབང་ཕྱུག་མགོན་པོ་ཐུགས་རྗེ་ཅན་སེམས་ཅན་ལ་བྱམས་པ། སེམས་དག་པ་ལག་ན་པདྨ་ཅན་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པའི་བདག་ཉིད་ཅན་གྱི་བྱིན་གྱིས་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པས།
en: This practice was empowered by the compassionate protector of the world who affectionately cares for beings, the pure being with the lotus in his hand and a kind heart for all beings.

source: ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་ཀུན་དང་།
en: It was blessed by all the tathāgatas in the ten directions.

source: །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །སྲིན་པོ་ལྷ་མིན་གསང་བ་པ། །འཇིག་རྟེན་སྐྱོང་དང་ཚངས་པ་དང་། །དྲག་པོ་ཁྱབ་འཇུག་གཞོན་ནུ་སོགས། །གཤིན་རྗེ་ཆུ་ལྷ་ལུས་ངན་དང་། །དྲང་སྲོང་སོགས་དང་དེ་བཞིན་དུ། །ཟླ་ཉི་ཀུན་འགྱེད་གཞོན་ནུ་དང་།
en: The devas, nāgas, yakṣas, rākṣasas, asuras, guhyakas, and world protectors, as well as Brahmā, Rudra, Viṣṇu, Kumāra, and so forth, and Yama, Varuṇa, Kubera, the hosts of ṛṣis, Candra, Sūrya, the nakṣatras, Īśvara, and Maheśvara, will all swiftly arrive as soon as the mudrā is formed. “

source: །དེ་བཞིན་དབང་ཕྱུག་དབང་ཆེན་དག །ཕྱག་རྒྱ་བཅིངས་པ་ཙམ་གྱིས་ནི། །དེ་དག་མྱུར་དུ་འདུ་བར་འགྱུར། །སྒྲོལ་མ་བདུན་ནི་འདུ་བར་འགྱུར། །དེ་བཞིན་ཕ་རོལ་ཕྱིན་བཅུ་དག །མགྲིན་སྔོན་དེ་བཞིན་གོས་དཀར་ཅན།
en: As soon as this mudrā and mantra are employed, the seven stars will arrive, as will the Pāramitās.

source: །དེ་བཞིན་པདྨ་གར་གྱི་དབང་། རྒྱལ་དང་རྣམ་རྒྱལ་ཉིད་དང་ནི། །ལྕགས་སྒྲོག་རྡོ་རྗེ་ལྕགས་སྒྲོག་དང་། །ལྷ་མོ་ཁྲོ་གཉེར་མཱ་མ་ཀཱི། །དཔེ་མེད་ཕོ་ཉ་མོ་དང་ནི། །འཇིགས་མེད་དཔལ་དང་དབྱངས་ཅན་དང་། །པདྨ་ཀོ་ཏི་ཨུཏྤ་ལ། །པདྨའི་སོ་ཅན་དེ་བཞིན་དུ། །ཏི་སེ་ཡི་ནི་རྩེ་མོ་ན། །འཕྲོག་མ་འབྱུང་པོའི་མ་དག་དང་། །དེ་བཞིན་ལག་ན་རྡོ་རྗེ་བཅུ།
en: So too will Nīlakaṇṭhī, Pāṇḍaravāsinī, Padma­narteśvarī, Jayā, Vijayā, Śaṅkalī, Vajraśaṅkalī, Māmakī, the goddess Bhṛkuṭī, Anaupamyā, Dyuti, Bhīmā, Śrī, Sarasvatī, Padmakoṣṭhī, Utpalī, Puṣpadantī, Kailāsa­śikhara­vāsinī, Hārītī the mother of bhūtas, and the ten mahābalā goddesses who attend upon Vajrapāṇi.

source: །མཐུ་ཆེན་དེ་བཞིན་རིག་འཛིན་དབང་། །རྡོ་རྗེ་འཆང་ཆེན་དེ་བཞིན་དུ། །བཅུ་གསུམ་ལྷ་དབང་ལྷན་ཅིག་དང་། །སུམ་ཅུ་གཉིས་ནས་ལྷ་དག་ནི།
en: The great Vajradhara will arrive with the other lords of vidyādharas and the chief god of the realm of Thirty-Three, together with the remaining thirty-two gods from his realm.

source: །གསང་སྔགས་ཕྱག་རྒྱ་བཅིངས་ཙམ་གྱིས། །དེ་དག་ཐམས་ཅད་འདུ་བར་འགྱུར།
en: They will all arrive together, as soon as the vidyā holder employs the mudrā and mantra.

source: །ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་གཟིགས་ཤིང་སྟོན་པར་མཛད་དོ།
en: All the tathāgatas will notice him and appear to him.

source: །དེའི་མོད་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་རྣམ་པར་གཟིགས་ཤིང་རྟག་ཏུ་མཆོག་སྩོལ་བར་འགྱུར་རོ།
en: At the same time, the bodhisattvas will also notice him and grant him boons. They will always appear before him whenever he wishes them to. “

source: །རྟག་ཏུ་མགོན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྤྱན་སྟོང་དང་། ཕྱག་རྒྱ་སྣ་ཚོགས་པ་འཛིན་པ་ལྟ་འཚལ་བར་འགྱུར་རོ། །ཕྱག་རྒྱ་བཅིངས་པ་ཙམ་གྱིས་ནི། །བྲམ་ཟེའི་ཆ་ལུགས་དོན་ཡོད་ཞགས།
en: As soon as the vidyā holder displays the mudrā, Noble Avalokiteśvara will appear before him in his form of a thousand-armed and thousand-eyed protector holding different implements.

source: །མཐོང་བར་འགྱུར་ཏེ་སོམ་ཉི་མེད།
en: There is no doubt about this.

source: །མགྲིན་སྔོན་དང་ནི་རྟ་མགྲིན་དང་། །དེ་བཞིན་རྒྱ་མཚོའི་ཀློང་དང་ནི།
en: Or, he may appear in the form of Brahmā, Amoghapāśa, Nīlakaṇṭha, Hayagrīva, or Vaḍabāmukha.

source: །མགོན་པོའི་ཞལ་ནི་བཅུ་གཅིག་དང་། །དེ་བཞིན་ཞལ་ནི་བཞི་དག་དང་།
en: The Lord may appear in his eleven-faced or four-faced form.

source: །མགོན་པོ་འཇིགས་པ་བརྒྱད་འཕྲོག་དང་། །དེ་བཞིན་གཟིགས་པ་བསམ་མི་ཁྱབ། །རྣམ་པ་སྣ་ཚོགས་གཟུགས་དང་ནི། །སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན། །ཕྱག་རྒྱ་བཅིངས་པ་ཙམ་གྱིས་ནི།
en: The inconceivable Lord Avalokita, who removes the eight types of fear, can thus show himself in all these different forms, representing various illusory samādhis.

source: །མགོན་པོ་ཐམས་ཅད་སྟོན་པར་མཛད།
en: He can display all these as soon as the vidyā holder forms this mudrā of the Lord. “

source: །བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་ཁམས། །རྒྱལ་བ་འདྲེན་པ་འོད་དཔག་མེད། །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་བསྐོར་བ།
en: The Lord may instantly appear as the victorious guide Amitābha in his realm of Sukhāvatī, surrounded by a retinue of bodhisattvas.

source: །མགོན་པོ་མོད་ལ་མཐོང་བར་འགྱུར། །གཞན་ཡང་སངས་རྒྱས་སྟོང་གི་ཞིང་དག་ནི། །ཆུ་བོ་གང་གཱའི་བྱེ་མ་དང་མཉམ་པའི།
en: The vidyā holder will also see thousands of other buddha fields, as numerous as the grains of sand in the Gaṅgā river.

source: །དེ་བཞིན་གཤེགས་འབུམ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་། །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་བཅས་ཡོངས་བསྐོར་མགོན། །ཕྱག་རྒྱ་བཅིངས་པ་ཙམ་གྱིས་མཐོང་བར་འགྱུར།
en: He will see hundreds of thousands of millions of billions of tathāgatas there, surrounded by hosts of bodhisattvas, as soon as he displays the mudrā of the Lord.

source: །མཐོང་བ་ཆེན་པོའི་རྣམ་པར་གཞན་མཐོང་སྟེ། །ཉིན་གཅིག་བཞིན་དུ་བྱང་ཆུབ་སྙིང་པོ་དང་། །ཆོས་ཀྱི་འཁོར་ལོ་དེ་བཞིན་རྡོ་རྗེའི་གདན།
en: Every day he will see many other great things, such as the seat of awakening, the Dharma wheel, the vajra seat, and the defeat of Māra.

source: །དེ་དག་རྨི་ལམ་སྣང་བ་མཐོང་འགྱུར་བས། །དེ་ལ་ཡིད་གཉིས་སོམ་ཉི་ཐེ་ཙོམ་མེད།
en: He will see them in his dreams at night; one should not harbor any doubts about this or call it into question. “

source: །སངས་རྒྱས་རྣམས་ཀྱིས་བཤུང་བའམ་མཚམས་མེད་ལྔ། །མགོན་པོ་ཆེ་ལ་གདུག་སེམས་ཉིད་དང་ནི། །བྱང་ཆུབ་སེམས་དཔའི་བར་ཆད་འཕགས་པ་ལ། །ཁ་ཟེར་བ་དང་དམ་ཆོས་བསླུ་བ་དང་། །རྒྱལ་བས་གསུངས་སྤོང་མནར་མེད་གཞོལ་བ་དང་།
en: Those who display this mudrā will not be decried by the buddhas, even if they were destined for rebirth in the Avīci hell because they committed the five acts of immediate retribution, obstructed the great bodhisattva lords out of wickedness, reviled the noble ones, disputed the true Dharma, or rejected the teachings of the victors.

source: །མི་བཟད་དམྱལ་བ་བཅུ་དྲུག་གནས་པ་དང་། །བསྐལ་པ་འབུམ་པོ་ཐམས་ཅད་སྐད་ཅིག་གྲོལ།
en: Even all those trapped in the sixteen terrible hells for millions of eons will be instantly liberated. “

source: །ཕྱག་རྒྱ་གསང་སྔགས་བཟླས་པ་ཙམ་གྱིས་སམ། །ཐོས་སམ་མཐོང་ངམ་མིང་ནི་བཟུང་བས་ཀྱང་། །སྡིག་པ་དེ་ཀུན་འཇིག་འགྱུར་སོམ་ཉི་མེད།
en: As soon as the vidyā holder employs this mudrā and mantra and focuses on Amoghapāśa’s name, all his wrongdoings will be purified; there is no doubt about this.

source: །དོན་ཞགས་སྙིང་པོའི་ཕྱག་རྒྱ་མཐོང་བ་ཡང་། །འཇིག་རྟེན་མགོན་དང་མཚུངས་ཏེ་ཁྱད་པར་འཕགས།
en: Seeing this heart mudrā of Amoghapāśa is the same as seeing Lord Amoghapāśa himself.

source: །སངས་རྒྱས་འབུམ་ཕྲག་སྟོང་དང་གང་གཱ་ཡི། །བྱེ་བ་བརྒྱ་སྟོང་དག་ནི་མཐོང་བར་འགྱུར། །བྱང་ཆུབ་སྙིང་པོར་གཏོགས་པ་ཐམས་ཅད་དང་། །ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་མཚུངས།
en: Furthermore, he will see thousands of billions of buddhas equal to the number of water drops in hundreds of thousands of Gaṅgā rivers, all of them sitting on the seat of awakening and turning the wheel of Dharma.

source: །དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ཕྱག་རྒྱ་དང་།
en: This mudrā, no different from the heart essence of Amogharāja, is a visual representation of his mantra.

source: །གསང་སྔགས་མཐོང་ན་བསོད་ནམས་ཕུང་ཆེན་གྱི། །བསོད་ནམས་ཕུང་པོ་འདི་དག་འཕེལ་བར་འགྱུར།
en: Upon seeing it, the vidyā holder will accumulate a lot of merit, its store ever increasing.

source: །དེ་ཡི་ཚེ་ཡང་རྣམ་པར་འཕེལ་བར་འགྱུར། །དེ་ནི་དཔག་ཏུ་མེད་པ་སོམ་ཉི་མེད།
en: His lifespan will increase infinitely; there is no doubt about this. “

source: །དེ་ནས་རིག་སྔགས་འཆང་བ་གཙང་གྱུར་ནས། །གཙང་མའི་གོས་བགོས་ནས་ནི་ཐོག་མར་ཡང་། །ཡོ་བྱད་བསྒྲུབ་པ་གཙང་ཞིང་སྤྱོད་པ་གཙང་།
en: In preparation for the rite, the vidyā holder should purify himself ritually, put on clean clothes, and, remaining pure, practice pure conduct at all times.

source: །རྟག་ཏུ་ཡན་ལག་སྤོས་ནི་སྣ་ཚོགས་དང་། །སྣ་ཚོགས་བདུག་པས་རབ་ཏུ་བདུགས་བགྱིས་ཤིང་། །དཔུང་པ་ལག་པ་ལྷ་ཡི་སྤོས་ཀྱིས་བྱུག །
en: He should smear his body with various fragrances, anoint his arms and hands with fragrant unguents, and perfume it with various types of incense.

source: གཙང་མའི་ས་ཕྱོགས་གཙང་མའི་གདན་བཤམས་པར། །སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་ནི་བྱམས་སེམས་དང་། །སྙིང་རྗེའི་ལྷག་བསམ་དེ་ཉིད་མཉམ་བཞག་ནས།
en: Sitting in a cross-legged posture in a clean place on a clean seat of spread grass, he should engender thoughts of loving kindness and the true spirit of compassion.

source: །ཕྱོགས་བཅུའི་དུས་གསུམ་གཤེགས་པའི་སངས་རྒྱས་དང་། །རྟག་ཏུ་འཇིག་རྟེན་དབང་ལ་ཕྱག་བགྱི་ཞིང་། །རྟག་ཏུ་བླ་མ་མཆོད་ཅིང་ཆོས་ལ་བརྩོན།
en: He should continuously salute the buddhas of the ten directions and the three times and make offerings to the Lokeśvara and to his master, his thoughts focused on the Dharma.

source: །ཤིན་ཏུ་རིག་པས་ཚིག་གཞན་མི་སྨྲ་བར།
en: Refraining from speaking, the vidyā holder who is acquainted with the procedure should then perform the rite of protection.

source: །ཤིན་ཏུ་རིག་པས་བསྲུང་བའི་ཆོ་ག་བགྱི། །ཤིན་ཏུ་བཀྲ་ཤིས་བླ་མ་དེ་ཉིད་གུས། །བདེན་པར་སྨྲ་ཞིང་སྙན་པར་སྨྲ་བ་དང་། །སེམས་ཅན་ཀུན་ལ་སྙིང་རྗེའི་བདག་ཉིད་ཅན། །ལྷན་ཅིག་རྗེས་མཐུན་གྱུར་ནས་དེ་ནས་ནི།
en: In the spirit of reverence for the master, he should follow the rules impeccably, speak the truth, speak pleasantly, feel compassion for all beings, and always practice kindness. “

source: །ཕྱག་རྒྱ་འདི་བཅིང་བར་བགྱི་སྟེ།
en: The vidyā holder should then form the mudrā as follows.

source: ལག་པ་པདྨའི་ཚུལ་དུ་བཞག་ལ། སོར་མོ་རྣམས་མཉམ་པར་བཅིངས་ཏེ། མཐེའུ་ཆུང་ཟླ་བའི་ཚུལ་དུ་སྙིང་གར་གཞག་གོ།
en: Making his hands into the shape of a lotus, with the thumbs aligned and touching each other, he should make the shape of the moon with the index fingers, positioning them against his chest.

source: །ཕྱག་རྒྱ་འདི་ནི་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོའི་རྩ་བའི་ཕྱག་རྒྱ་སྟེ།
en: This mudrā is the heart essence of Amogharāja.

source: བྱང་ཆུབ་སྙིང་པོའི་བར་དུ་སྩོལ་བར་བགྱིད་དོ།
en: Being his root mudrā, it brings the realization of the Buddha.

source: །མགོན་པོ་འཇིག་རྟེན་དབང་ཕྱུག་དགུག་པའི་གསང་སྔགས་འདི་བརྗོད་དོ།
en: To summon the lokeśvara Lord, one should recite the following mantra: [88] “Oṁ, homage to you with a miraculous panoptic amogha vision!

source: །ཨོྃ་ཨ་མོ་གྷ་བི་ཀུ་རྦྦི་ཏ་ས་མནྟ་ཨ་བ་ལོ་ཀཱ་ཡ་ན་སྟྲཻ་ཡ་དྷྭ།
en: O amogha lotus of the tathāgatas who are established throughout the three times!

source: ཨ་དྷི་ཥྛི་ཏ་ཨ་མོ་གྷ་པདྨེ། ཙ་ར་བི་ཙ་ར་སཉྩ་ར་ཧཱུྃ་ཧཱུྃ།
en: Be active, diffuse, and unite, hūṁ hūṁ! “

source: དེ་མ་ཐག་ཏུ་དུས་གསུམ་ལ་རྣམ་པར་ལྟ་བ་དོན་ཡོད་པའི་རྒྱལ་པོ་པདྨ་འབར་བ་གསལ་བའི་ཆོ་འཕྲུལ་དང་བཅས་པའི་ཕྱག་རྒྱའི་རྒྱལ་པོས་ཤིན་ཏུ་ཕྲ་བའི་རྡུལ་དང་མཉམ་པའི་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མང་པོ་མཐའ་དག་ཆེར་གཡོས་པར་འགྱུར་རོ།
en: Immediately, the king of mudrās present throughout the three times will magically manifest the open, blazing amogha lotus, one that is perceived throughout the three times. The surrounding buddha fields, as numerous as the atoms in the universe, will quake violently.

source: །དུས་གསུམ་དུ་གཤེགས་ཤིང་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སྐུ་ལས་འོད་ཟེར་སྣ་ཚོགས་འབུམ་ཕྲག་བརྒྱ་སྟོང་དུ་མ་དག་བྱུང་ནས།
en: The blessed buddhas of the three times who dwell there will send forth many hundreds of thousands of millions of multicolored rays of light.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་དགྱེས་ཤིང་། སངས་རྒྱས་ཀྱི་ཞིང་ལ་མཛད་པའི་ཐུགས་རྗེ་ཆེན་པོས་ཕྱག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་བརྐྱང་ནས། རིག་སྔགས་འཆང་གི་སྤྱི་བོར་འཇོག་པར་འགྱུར་རོ།
en: Each of these tathāgatas, thrilled with joy and filled with great compassion, will extend his golden arm and, with buddha-like care, place it upon the head of the vidyā holder.

source: །སྒྲུབ་པ་དམ་པ་དོན་ཡོད་པའི་རྣམ་པར་འཕྲུལ་པའི་བྱིན་གྱི་རླབས་ཀྱི། བྱིན་གྱིས་བརླབས་པ་སྩོལ་བར་འགྱུར་རོ། །དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། ཚངས་པ་དང་། ལྷའི་བུ་དང་། གཤིན་རྗེ་དང་།
en: Each of them will grant him the supreme accomplishment and give him the blessings that arise from the miraculous amogha manifestation.

source: ཆུ་ལྷ་དང་། ལུས་ངན་དང་། ཁྱབ་བདག་དང་། ཀུན་འགྱེད་གཞོན་ནུ་ལ་སོགས་པ་ལྷ་རྣམས་སྲུང་བ་དང་། སྐྱོབ་པ་དང་།
en: The gods Īśvara, Maheśvara, and Brahmā, and other deities such as Yama, Varuṇa, Kubera, Vāsava, and Sanatkumāra, will stand by to guard, protect, and defend him.

source: སྦེད་པར་བགྱིད་པར་འགྱུར་རོ། །ཕྱག་རྒྱ་བཅིངས་པ་ཙམ་གྱི་མོད་ལ་སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་དང་། འཇིགས་པ་བརྒྱད་རྣམས་དང་། ཆད་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ།
en: This mudrā, through merely being displayed, can remove all negativity and obscurations and deliver the vidyā holder from the eight great fears.

source: །དེའི་གྲུབ་པ་ཡིད་དུ་མཆི་བར་འགྱུར་རོ།
en: With the obscurations gone, the desired accomplishment will follow.

source: །ལས་ཐམས་ཅད་བགྱིད་པའི་ཕྱག་རྒྱ་ཐམས་ཅད་དུ་མཆོག་ལགས་པར་གྲགས་པ་ལགས་སོ། །དོན་ཡོད་དམ་ཚིག་མཆོག་གྲགས་པ།
en: This mudrā, supreme in every respect, is said to accomplish every activity. “

source: །པདྨ་རྒྱས་པའི་ཕྱག་རྒྱ་བཅིང་།
en: Formed in the shape of an open lotus, this mudrā is known as the main amogha samaya mudrā.

source: །མཛུབ་མོ་གུང་མོ་རྣམས་པདྨ་ལྕགས་ཀྱུའི་ཚུལ་དུ་བགྱིས་ལ། སེན་མོ་མཉམ་པར་གཞག་པའི་ཕྱག་རྒྱ་འདི་བསྟན་ཏེ། རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་རྩེ་བའི་ཕྱག་རྒྱ་འཛིན་པའི་གསང་སྔགས་འདི་བརྗོད་དོ།
en: When the middle fingers and the thumbs are made to resemble lotus goads, with the nails positioned evenly, this mudrā is called equanimity, and it makes for a full maṇḍala of liberation.

source: །ཨོཾ་ཨ་མོ་གྷ་པད་མཱྃ་ཀུ་ཤེ་ས་མ་ན་ཡཱ་ན།
en: While forming this mudrā, the vidyā holder should recite the mantra: [89] “Oṁ, amogha lotus-goad!

source: གྲྀཧྞ་གྲྀཧྞ།
en: Catch, catch the samaya!

source: དྷ་ར་དྷ་ར།
en: Hold it, hold!

source: མ་ཧཱ་སཏྭ་ཧཱུྃ།
en: O great being, hūṁ! “

source: ཕྱག་རྒྱ་བཅིངས་ཏེ་བཅིངས་མ་ཐགས་ཏུ་འམ། བཟླས་པ་ཙམ་གྱིས་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་ལེགས་སོ་ཞེས་བགྱི་བ་སྩོལ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་དགྱེས་པ་དང་།
en: Immediately after the vidyā holder forms the mudrā and pronounces the mantra, the blessed buddhas of the three times will applaud him.

source: མཉེས་པ་དང་། རབ་ཏུ་དགྱེས་པ་དང་། ཚིམ་པ་དང་། ཐུགས་དགྱེས་པ་སྐྱེ་བར་འགྱུར་ཞིང་། རིག་སྔགས་འཆང་ལ་ཐུགས་རྗེ་ཆེན་པོ་རྒྱས་པའི་སྙིང་པོ་གྲུབ་པ་དམ་པ་སྩོལ་བར་འགྱུར་ཞིང་།
en: All the tathāgatas, uplifted with joy, pleased, and with great compassion swelling in their hearts, will grant the vidyā holder the supreme accomplishment.

source: ཡང་ནས་ཡང་དུ་མཐོང་བ་སྩོལ་བར་འགྱུར་རོ། །མཆོག་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ།
en: They will appear to him again and again, bestow upon him every boon, and grant him the accomplishment of the amogha samaya.

source: །དོན་ཡོད་པའི་ཞགས་པའི་དམ་ཚིག་གྲུབ་པ་སྩོལ་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་ཞིབ་མོ་ཕྱག་རྒྱ་དང་གསང་སྔགས་འཛིན་པ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གཟུང་བ་ཙམ་གྱིས་དམ་ཚིག་རྗེས་སུ་འཇུག་པར་འགྱུར་རོ།
en: Once he comprehends the maṇḍala of liberation consisting in the rites, mudrās, mantras, and dhāraṇīs of secret maṇḍala of all the tathāgatas, he will enter into the samaya.

source: །ཐམས་ཅད་དུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གསང་བའི་དཀྱིལ་འཁོར་ཕྱག་རྒྱ་དང་དམ་ཚིག་འཚལ་བར་འགྱུར་རོ། །ཐམས་ཅད་དུ་དགོས་པའི་གསང་སྔགས་འགྲུབ་པར་འགྱུར་རོ།
en: He will then understand this secret maṇḍala of Noble Avalokiteśvara in every respect and will fully accomplish the mantras for the necessary tasks.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མཆོག་སྦྱིན་པ་རྟག་ཏུ་བལྟ་འཚལ་བར་འགྱུར་རོ།
en: Noble Avalokiteśvara will become the giver of boons, appearing to him and granting his wishes. “

source: །ལག་མཐིལ་པདྨ་ལྟར་བགྱིས་ལ་མཛུབ་མོ་གུང་མོ་རྡོ་རྗེ་ལྟར་བགྱི་ཞིང་།
en: The vidyā holder should form the shape of the lotus with the palms of his hands.

source: མཐེ་ཆུང་བརྐྱང་བའི་ཕྱག་རྒྱ་ནི།
en: The middle fingers and the thumbs should be joined, forming a vajra point, and the little fingers should be outstretched.

source: །པདྨ་འཆང་ལ་བདུག་པ་དང་། །མེ་ཏོག་ལ་སོགས་དྲི་རྣམས་དང་། །ཕྲེང་བ་བྱུག་པ་ཕྱེ་མ་དང་། །བ་དན་གོས་དང་རྒྱན་དང་ནི། །གཏོར་མ་མཆོད་ཡོན་རབ་ཏུ་དབུལ།
en: While forming this mudrā, he should offer incense, flowers, perfume, garlands, unguents, scented powders, silken clothes, and adornments to the lotus bearer.

source: །བུམ་པ་གང་བའི་དྲི་སོགས་དང་།
en: He should offer a bali and a welcome offering including jars filled with perfume and so forth.

source: །ཚོན་སྐུད་སྣ་ལྔ་ཚོན་དབྱེའོ། །གཞན་ཡང་ཟས་ནི་སྣ་ཚོགས་ལ།
en: He should also use the five-colored threads and various food articles.

source: །ཕྱག་རྒྱ་འདི་ནི་ཀུན་ལ་མཆོག །འདི་ནི་དབུལ་བའི་ཕྱག་རྒྱར་གསུངས། །ཐམས་ཅད་དུ་ནི་དོན་ཡོད་མཆོག །
en: This mudrā is always supreme, supreme for conveying the articles of offering.

source: གོ་བར་བགྱི་བའི་ཕྱག་རྒྱ་འདི། །པདྨའི་ཕྱག་གིས་བྱིན་གྱིས་བརླབས།
en: This mudrā, empowered by Padmapāṇi, is for making amogha offerings. “

source: །གུང་མོ་ནོར་བུས་དཀྲིས་པ་ལྟ་བུའི་ཕྱག་རྒྱ་འདི་ནི་བག་ཚ་བ་མེད་པའི་པདྨ་རིན་པོ་ཆེའི་ཕྱག་རྒྱ་ལགས་ཏེ།
en: The same mudrā, but with a jewel enclosed between the hands, is the mudrā of the precious lotus-like fearlessness.

source: འདི་ནི་གྲུབ་པ་དམ་པ་ལགས་སོ། །སྤྱན་དྲང་བའི་གསང་སྔགས་ནི།
en: It is the best mudrā for successful summoning.

source: ཨོཾ་ཨ་མོ་གྷ་པདྨ་མ་ཧཱ་ས་ཏྱ་ཨཱ་ཡ་ཏུ་མི་ཧ་མཎྜ་ལེ།
en: The accompanying mantra is: [90] “Oṁ, Amoghapadma, the great being! Please come into this maṇḍala!

source: བི་རི་བི་རི་བི་རི་པདྨ་བྷུ་ཛེ་སྭཱ་ཧཱ།
en: Ciri ciri ciri! You with the lotus in your hand, svāhā! “

source: དུས་གསུམ་གཤེགས་པའི་སངས་རྒྱས་རྣམས། །གསོལ་བ་གདབ་པའི་གསང་སྔགས་ཏེ།
en: This mantra is for supplicating and inviting the buddhas who appear throughout the three times.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། །ཕྱག་ན་པདྨ་གསོལ་གདབ་དགུག །
en: It is for supplicating all bodhisattvas and for inviting Padmahasta.

source: ལྷ་རྣམས་ཀུན་དང་དེ་བཞིན་དུ། །དཀྱིལ་འཁོར་གྱི་ནི་ལྷ་རྣམས་དགུག །ཕྱག་རྒྱ་འདི་ནི་བཅིངས་པ་ཡིས།
en: It is also for summoning all the gods and maṇḍala deities.

source: །ཕྱོགས་བཅུ་ཀུན་གྱི་སངས་རྒྱས་དང་། །དེ་བཞིན་བྱང་ཆུབ་སེམས་དཔའང་འདུ། །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །དྲི་ཟ་ལྷ་མིན་དེ་བཞིན་དུ། །ནམ་མཁའ་ལྡིང་དང་མི་འམ་ཅི། །ལྟོ་འཕྱེ་ཆེན་པོ་ཉིད་དག་སྟེ།
en: When this mudrā is displayed, all the buddhas who dwell in the ten directions will arrive together, as will the bodhisattvas, devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: །དེ་ཀུན་སྐད་ཅིག་འདུ་འགྱུར་ཞིང་། །བསྲུང་བའི་ཕྱིར་ནི་སོམ་ཉི་མེད།
en: They will all arrive instantaneously to offer protection; there is no doubt about this. “

source: །ལག་པ་རྡོ་རྗེའི་ཚུལ་དུ་བཞག་ལ་ལག་པའི་མཐེའུ་ཆུང་རྣམས་པདྨའི་མཚམས་སུ་བྱ་སྟེ། གུང་མོ་རྣམས་ཡིད་ཙམ་བསྐུམས་པའི་ཕྱག་རྒྱ་བཅིངས་པ་ནི། །གྲུབ་ལྡན་འདི་ནི་ཕྱོགས་བཅིང་དང་། །དཀྱིལ་འཁོར་བཅིང་བར་བགྱིས་པ་ཡི།
en: When the hands form the shape of the vajra, the small fingers mark the edges of the lotus, and the middle fingers are contracted, this is the mudrā for demarcating the boundary.

source: །བསྲུང་བའི་ལས་ལ་བག་ཚ་མེད།
en: This mudrā is effective in the rites of binding the directions, securing the maṇḍala, and protection.

source: །ཕྱག་རྒྱ་འདི་ནི་བཅིངས་ཙམ་དང་། །གསང་སྔགས་སྟོང་ནི་བཟླས་ཙམ་གྱིས། །དཔག་ཚད་བདུན་ནི་ཁོར་ཡུག་ཏུ། །མཚམས་བཅིང་དཀྱིལ་འཁོར་བཅིང་བ་དང་། །བསྲུང་བའི་ལས་ནི་བགྱིས་པར་འགྱུར།
en: By merely forming this mudrā and reciting the mantra one thousand times, the boundary will be set with the radius of seven leagues; the maṇḍala will be secured, and the protection applied.
